app/controllers/boards_controller.rb

  def create
    @board = Board.new(board_params)

    if @board.save
---
INSERT INTO "boards" ("location", "image", "comment", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["location", "trk"], ["image", "1"], ["comment", "hi"], ["date", "2016-01-11"], ["created_at", "2016-01-11 15:43:26.884455"], ["updated_at", "2016-01-11 15:43:26.884455"]]